Revit 2022 API
EnergyAnalysisSpace.InnerVolume Property
 The analytical volume for this space.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2012
Syntax
C#
public double InnerVolume { get; }
Visual Basic
Public ReadOnly Property InnerVolume As Double
	Get
Visual C++
public:
property double InnerVolume {
	double get ();
}
Remarks
 The inner space volume is bounded by the interior surfaces.
See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace